### 0- Seaborn kütüphanesi içerisinde bulunan titanic datasini yukleyin

In [1]:
import seaborn as sns
titanic= sns.load_dataset('titanic')
df = titanic.copy()
df.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 1- Değişkenlerin veri türlerini yazınız

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

### 1- Nicel verileri describe methodu ile inceleyiniz ve 
### verileri ortalaması, standart sapması ve çeyrekliklerine gore:
#### a) aykırılık olup olmadığı konusunda
#### b) normal dağılıp dağılmadığı konusunda yorumda bulunun

In [3]:
df.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

a)Aykiri Deger :

    age: %75-%25 = 38-20 = 18 * 1.5 = 27 
         %75 + 27 = 38+27 = 65
         27-20 = 7   
        Age icin min deger 0.42 max deger 80 dir.
        Buna gore, 7 den kucuk ve 65 den buyuk degerler aykiri degerlerdir.
        
    sibsp: 1-0 = 1 * 1.5 = 1.5
           1.5 + 1 = 2.5
           1.5 - 0 = 1.5
          sibsp icin min deger 0 max deger 8 dir.
          Buna gore, 1.5 den kucuk ve 2.5 den buyuk degerler aykiri degerlerdir.
        
     parch: 0-0 = 0 * 1.5 = 0
           6 + 0 = 6
           0 - 0 = 0
          sibsp icin min deger 0 max deger 6 dir.
          Bu dgerlerin disinda kalan deger yoktur.
     
    fare: 31-7.9 = 23.1 * 1.5 = 34.6
           31 + 34.6 = 65.6
           34.6 - 31 = 3.6
          sibsp icin min deger 0 max deger 512 dir.
          Buna gore, 3.6 den kucuk ve 65.6 den buyuk degerler aykiri degerlerdir.

In [4]:
# age: 
    # mean 29 medyan 28 oldukca yakin degerler
    # ceyreklikler 20 ve 38 nispeten esit dagilmis
    # Normale oldukca yakin bir dagilim var diyebiliriz
    
# sibsp
    # 0 degeri cok fazla oldugundan medyan 0.Ceyreklikler 1 ve 0. Ortalama 0.5 
    # 0 etrafinda Normal dagilima yakin olmakla beraber uc degerler mevcut
    
# parch
    # medyan 0.Ceyreklikler 0. Ortalama 0.38 
    # 0 etrafinda Normal dagilima yakin olmakla beraber uc degerler mevcut
    
# fare
    # ortanca 14 ortalama 32 degerleri yakin olmadigi icin ceyreklikler daha iyi fikir verecektir.
    # 7.9 ve 31 degerleri ortalamadan cok uzak degiller. nispeten normale yakin dagilim var

### 2-Nitel verilerin dtypelarıını kategorik yapın. 
### Sıralanabilecek kategorik değişkenlerin sıralı olarak belirleyiniz. 
### Sıralanmış kategorik verilerin sıralaması doğru değilse sıralamayı uygun hale getirin.

In [5]:
# Mevcut data tiplerini gorelim

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [7]:
# Nitel verilerin kategorik yapin, kutuphaneyi import edip degisikligi astype ile yapariz

In [8]:
from pandas.api.types import CategoricalDtype

In [9]:
df.survived = df.survived.astype(CategoricalDtype(ordered = False))
df.sex = df.sex.astype(CategoricalDtype(ordered = False))
df.embarked = df.embarked.astype(CategoricalDtype(ordered = False))
df.adult_male = df.adult_male.astype(CategoricalDtype(ordered = False))
df.deck = df.deck.astype(CategoricalDtype(ordered = False))
df.embark_town = df.embark_town.astype(CategoricalDtype(ordered = False))
df.alive = df.alive.astype(CategoricalDtype(ordered = False))
df.alone = df.alone.astype(CategoricalDtype(ordered = False))
df.who = df.who.astype(CategoricalDtype(ordered = False))


df.pclass = df.pclass.astype(CategoricalDtype(ordered = True))
df['class']= df['class'].astype(CategoricalDtype(ordered = True))

In [10]:
# Tekrar data tiplerine baktigimizda degisikligin gerceklestigini goruruz.

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    category
 1   pclass       891 non-null    category
 2   sex          891 non-null    category
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    category
 8   class        891 non-null    category
 9   who          891 non-null    category
 10  adult_male   891 non-null    category
 11  deck         203 non-null    category
 12  embark_town  889 non-null    category
 13  alive        891 non-null    category
 14  alone        891 non-null    category
dtypes: category(11), float64(2), int64(2)
memory usage: 39.1 KB

In [12]:
# Siralama yanlis oldugu icin siralamayi duzeltiriz.

In [13]:
df['class'].head()

0    Third
1    First
2    Third
3    First
4    Third
Name: class, dtype: category
Categories (3, object): ['First' < 'Second' < 'Third']

In [14]:
class_categori = ['Third','Second','First']
df['class'] = df['class'].astype(CategoricalDtype(categories=class_categori, ordered = True))

In [15]:
# Yanlis siralamanin duzeldigini goruruz

In [16]:
df['class'].head()

0    Third
1    First
2    Third
3    First
4    Third
Name: class, dtype: category
Categories (3, object): ['Third' < 'Second' < 'First']

### 3- sex ve class değişkenlerini Label Encoder veya Dummies yöntemiyle sayısal verierle dönüştürünüz.

In [17]:
df[['sex','class']].head()

      sex  class
0    male  Third
1  female  First
2  female  Third
3  female  First
4    male  Third

In [18]:
from sklearn.preprocessing import LabelEncoder

In [19]:
labelencoder = LabelEncoder ()   # obje olusturduk

In [20]:
df.sex = labelencoder.fit_transform(df.sex)

In [21]:
df.sex

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: sex, Length: 891, dtype: int32

In [22]:
# Dummies

In [23]:
import pandas as pd

In [24]:
pd.get_dummies(df[['sex','class']])

     sex  class_Third  class_Second  class_First
0      1            1             0            0
1      0            0             0            1
2      0            1             0            0
3      0            0             0            1
4      1            1             0            0
..   ...          ...           ...          ...
886    1            0             1            0
887    0            0             0            1
888    0            1             0            0
889    1            0             0            1
890    1            1             0            0

[891 rows x 4 columns]

In [25]:
# 4- age ve fare değişkenlerinin normalliklerini inceleyiniz

In [26]:
from scipy.stats import normaltest

In [27]:
test_value,p_value=normaltest(df.fare)

In [28]:
p_value

3.727091062842147e-197

In [29]:
test_value,p_value=normaltest(df.age.dropna())

In [30]:
p_value

0.00011709599657350757

In [31]:
# Her iki TESTde de p degerinin 0.05 den kucuk oldugunu goruyoruz. Her iki dagilimda  normal dagilima sahip degildir

In [32]:
# Hipotez Testleri:
# H0 hipotezi Titanik kazasında insanlarin sosyo ekonomik siniflari hayatta kalma oranlarına herhangi bir etkisi yoktur
# H1 hipotezi Titanik kazasında insanlarin sosyo ekonomik siniflari hayatta kalma oranlarına herhangi bir etkisi vardır
# Hipotez test asamalarinin tamamini yukarda önerilen hipotez icin uygulayınız ve sonucu yorumlayiniz.

In [33]:
from scipy.stats import normaltest
from scipy.stats import shapiro
from statsmodels.stats.proportion import proportions_ztest
import numpy as np

In [34]:
df["alive"]=labelencoder.fit_transform(df["alive"])

In [35]:
# Farkli insan guruplarinin, hayatta kalip kalmadigini kontrol edecegimiz icin
# BAGIMSIZ IKI ORNEKLEM TESTI UYGULARIZ.

In [36]:
# Once A ve B Datasini belirleyelim. 
# A = yolcularin sosyal sosyo ekonimik sinifi yani biletinin sinifi olarak "class"'i , 
# B = yolcularin hayatta kalip kalmadigini gosteren sutun olarak "alive" olarak belirleriz.

A=df["pclass"]
B=df["alive"]
A_B = pd.concat([A, B], axis = 1)
A_B.columns = ["A","B"]

In [37]:
# Kontrol edelim, A sutunu bilet sinifini ve B sutunu hayatta kalip kalmadigini gosteriyor
A_B.tail()

     A  B
886  2  0
887  1  1
888  3  0
889  1  1
890  3  0

In [38]:
# Datalari islem yapabilecegimiz formata donustururuz

GRUP_A = np.arange(len(A))
GRUP_A = pd.DataFrame(GRUP_A)
GRUP_A[:] = "A"
A = pd.concat([A, GRUP_A], axis = 1)

#B ve B'nin Grubu
GRUP_B = np.arange(len(B))
GRUP_B = pd.DataFrame(GRUP_B)
GRUP_B[:] = "B"
B = pd.concat([B, GRUP_B], axis = 1)

#Tum veri
AB = pd.concat([A,B])
AB.head()

  pclass  0  alive
0      3  A    NaN
1      1  A    NaN
2      3  A    NaN
3      1  A    NaN
4      3  A    NaN

In [39]:
# Once SHAPIRO testi ile normal dagilim gosterip gostermedigine bakip
# PARAMETRIK mi yoksa NON-PARAMETRIK mi test uygulayacagimiza karar veririz.

In [40]:
shapiro(A_B.A)

ShapiroResult(statistic=0.718337893486023, pvalue=3.3958319924210316e-36)

In [41]:
# A gurubu yani "pclass" gurubu'nun p degeri e-36 gibi cok kucuk bir degerdir yani normal dagilim degildir

In [42]:
shapiro(A_B.B)

ShapiroResult(statistic=0.616659939289093, pvalue=1.7945308393836472e-40)

In [43]:
# B gurubu yani "alive" gurubu'nun p degeri e-40 gibi cok kucuk bir degerdir yani normal dagilim degildir

In [44]:
# Her iki gurup da normal dagilima sahir degildir. NON PARAMETRIK test uygulamamiz gerekir

In [45]:
# Ama once 2 veri karsilastirilacagi zaman VARYANS HOMOJENLIGI Testi de yapmamiz gerekir

In [46]:
# H0 = varyanslar homojen
# H1 = varyanslar homojen degil

In [47]:
import scipy.stats as stats
stats.levene (A_B.A, A_B.B)

LeveneResult(statistic=90.04223321250018, pvalue=7.189908883210466e-21)

In [48]:
# p value 0,000 < 0.05  H1 durumu geceerlidir yani varyanslar homojen degildir.

In [49]:
# Ama yine de teste devam ediyoruz.

In [50]:
# Hipotez testi icin Parametrik test olan ttesi degil NON-PARAMERIC manmwhitneyu testini kullanacagiz

In [51]:
stats.mannwhitneyu(A_B["A"], A_B["B"])

MannwhitneyuResult(statistic=36936.0, pvalue=1.497607847198619e-262)

In [52]:
# p degeri 0,05 den cok cok kucuk bir degerdir

In [56]:
# Bir de test istatitiginide kullanarak test edelim
test_istatistigi, pvalue = stats.mannwhitneyu(A_B["A"], A_B["B"])
print('Test İstatistiği = %.4f, p-değeri = %.4f' % (test_istatistigi, pvalue))

Test İstatistiği = 36936.0000, p-değeri = 0.0000

In [54]:
# Burada da p degeri 0,05 den cok cok kucuk bir degerdir

In [55]:
# SONUC OLARAK : 
# H0 reddedilir.
# H1 testi olan Titanik kazasında insanlarin sosyo ekonomik siniflari hayatta kalma oranlarına herhangi bir etkisi vardır durumu
# % 95 guvenilirlikle dogru kabul edilir.